"""
Python数轴、长整型，编程练习题实例二：
简述：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，
可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，
高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成.

提问：从键盘输入当月利润I，求应发放奖金总数？
Python解题思路分析：请利用数轴来分界及定位。并要注意定义时需要把奖金定义成长整型的数据类型。
"""


def profit():
    i = int(input('请输入当月利润：'))
    if i <= 100000:
        bonus = i * 10 / 100
        print(bonus)
    elif 100000 < i <= 200000:
        bonus = ((i - 100000) * 7.5 / 100) + (100000 * 10 / 100)
        print(bonus)
    elif 200000 < i <= 400000:
        bonus = (i - 200000) * 5 / 100 + (200000 * 10 / 100)
        print(bonus)
    elif 400000 < i <= 600000:
        bonus = (i - 400000) * 3 / 100 + (400000 * 10 / 100)
        print(bonus)
    elif 600000 < i <= 1000000:
        bonus = (i - 600000) * 1.5 / 100 + (600000 * 10 / 100)
        print(bonus)
    elif 10000000 < i:
        bonus = (i - 1000000) * 1 / 100 + (1000000 * 10 / 100)
        print(bonus)
    # elif i == 9999999:
    #     bonus = (i - 1000000) * 1 / 100 + (1000000 * 10 / 100)
    #     print(bonus)


profit()

